import telebot

bot = telebot.TeleBot('5973087473:AAEEhJbBk6DwHq8nf51tDsVcD5JlOr_nxWg')


@bot.message_handler(commands=['start'])
def send_welcome(message):
  keyboard = telebot.types.ReplyKeyboardMarkup()
  keyboard.row('Понеділок', 'Вівторок', 'Середа', 'Четвер', 'Пятниця')
  bot.send_message(message.chat.id,
                   'Виберіть день тижня:',
                   reply_markup=keyboard)


@bot.message_handler(func=lambda message: True)
def handle_message(message):
  if message.text == 'Понеділок':
    options = [
      '1 урок: 8:30 - 9:15 - Тр.навчання ',
      '2 урок: 9:25 - 10:10 - Тр.навчання',
      '3 урок: 10:20 - 11:05 - Німецька мова (№25/34)',
      '4 урок: 11:20 - 12:05 - Зарубіжна літ-ра (№34)',
      '5 урок: 12:20 - 13:05 - Математика (№34)',
      '6 урок: 13:20 - 14:05 - Географія (№3)'
    ]
  elif message.text == 'Вівторок':
    options = [
      '1 урок: 8:30 - 9:15 - Англ.мова (№34/5) ',
      '2 урок: 9:25 - 10:10 Мистецтво (№16)',
      '3 урок: 10:20 - 11:05 - Історія (№34)',
      '4 урок: 11:20 - 12:05 - Укр.мова(№34)',
      '5 урок: 12:20 - 13:05 - Математика (№34)',
      '6 урок: 13:20 - 14:05 - Фіз-ра'
    ]
  elif message.text == 'Середа':
    options = [
      '1 урок: 8:30 - 9:15 Англ.мова (№34/5) ',
      '2 урок: 9:25 - 10:10 - Математика (№34)',
      '3 урок: 10:20 - 11:05 - Інформатика',
      '4 урок: 11:20 - 12:05 - Зарубіжна літ-ра (№34)',
      '5 урок: 12:20 - 13:05 - Укр.мова(№34)',
      '6 урок: 13:20 - 14:05 - Німецька мова (№25/34)',
      '7 урок: 14:15 - 15:00 - Біологія (№25)'
    ]
  elif message.text == 'Четвер':
    options = [
      '1 урок: 8:30 - 9:15 Укр.літ (№34) ',
      '2 урок: 9:25 - 10:10 - Укр.мова(№34)', '3 урок: 10:20 - 11:05 - Фіз-ра',
      '4 урок: 11:20 - 12:05 - Математика (№15)',
      '5 урок: 12:20 - 13:05 - Географія (№3) ',
      '6 урок: 13:20 - 14:05 - Основи зд. (№16)'
    ]
  elif message.text == 'Пятниця':
    options = [
      '1 урок: 8:30 - 9:15 Укр.літ (№34) ',
      '2 урок: 9:25 - 10:10 - Укр.мова(№34)', '3 урок: 10:20 - 11:05 - Фіз-ра',
      '4 урок: 11:20 - 12:05 - Математика (№15)',
      '5 урок: 12:20 - 13:05 - Історія (№5)',
      '6 урок: 13:20 - 14:05 - Біологія (№25)',
      '7 урок: 14:15 - 15:00 - Англ.мова (№34/5) '
    ]
  else:
    options = []
  if options:
    message_text = '\n'.join(options)
    bot.send_message(message.chat.id,
                     f'Розклад для {message.text}:\n{message_text}')
  else:
    bot.send_message(message.chat.id, 'Я не розумію, що ви маєте на увазі.')


bot.polling()
